app/controllers/posts_controller.rb

	def index
		@post = Post.order('created_at DESC')
---
SELECT "posts".* FROM "posts"  ORDER BY :created_at DESC

	def post
		@post = Post.friendly.find(params[:post])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]

	def create
		@post = Post.new(post_params)

		if @post.save
---
INSERT INTO "posts" ("title", "message", "slug", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Post por formulário"], ["message", "sad"], ["slug", "post-por-formulario"], ["created_at", "2015-02-09 14:11:43.938202"], ["updated_at", "2015-02-09 14:11:43.938202"]]